In [8]:
import pandas as pd

# read CSV, arguments: filename, na_values, usecols = to select
# which columns in the file will be used
edu = pd.read_csv('/Users/lara/repos/introduction_to_data_science/introduction-datascience-python-book-master/files/ch02/educ_figdp_1_Data.csv',
                 na_values = ':',
                 usecols = ['TIME', 'GEO', 'Value'])

In [9]:
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [11]:
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [12]:
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [14]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [16]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [17]:
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [18]:
# selecting data

# subset
edu['Value']

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

In [19]:
#subset of rows (=slice of rows)
# the slice does not use the index labels as references, 
# but the position
edu[10:14]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

In [21]:
# subset of columns and rows with ix indexing
edu.loc[90:94, ['TIME', 'GEO'] ]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [22]:
# filtering data with boolean indexing
# <, <=, >, >=, =, !=
edu[edu['Value']>6.5].tail()

     TIME      GEO  Value
286  2010    Malta   6.74
287  2011    Malta   7.96
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [23]:
# filtering missing values
# pandas uses the special value NaN (not a number) to represent 
# missing values

# the only safe way to tell whether a value is missing in a df is
# using the isnull() function

edu[edu['Value'].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

In [24]:
# manipulating data
# most straightforwad: operate with columns or rows using
# aggregation functions
# count(), sum(), mean(), median(), min(), max(), prod(), std(), var()

# if a function is applied to a DF, specify if the function is applied
# to the rows for each column (axis = 0) or on the columns for each
# row (axis = 1)

edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object